---
kind: type
id: T:Autodesk.Revit.DB.ElementFilter
source: html/b8b46cbf-9ecc-0745-ec53-c3c3b6510113.htm
---
# Autodesk.Revit.DB.ElementFilter

A base class for a type of filter that accepts or rejects elements based upon criteria.

## Syntax (C#)
```csharp
public class ElementFilter : IDisposable
```